#+TITLE: TEST PRESENTATION
#+AUTHOR: Jay Kamat
#+EMAIL: jaygkamat@gmail.com

* This is a test file


* Nested
#+BEGIN_SRC C++ :includes <iostream> :exports output :results output :cache yes
using namespace std;
// C++ swapping function
int swap(int& a, int& b) {
     int tmp = a;
     a = b;
     b = tmp;
}
int main() {
     cout << "Swapping test:" << endl;
     int a = 1;
     int b = 2;
     cout << "a: " << a << " b: " << b << endl;
     swap(a, b);
     cout << "a: " << a << " b: " << b << endl;
     swap(a, b);
     cout << "a: " << a << " b: " << b << endl;
}
#+END_SRC

#+RESULTS[80bed32c3e8eb712c42a8048f4a8c06f971ec87f]:
: Swapping test:
: a: 1 b: 2
: a: 2 b: 1
: a: 1 b: 2
